let data_common_question = {
    how: [
        {
            question: "як ти почуваєшся",
            answer: {
                answer: "Нормально",
                answer_question: "Чудово. А ти як почуваєш ?"
            },
        },
        {
            question: "як ти відпочив",
            answer: {
                answer: "Занадто швидко пройшов відпочинок, але дуже класно відпочив",
                answer_question: "Чудово. А ти як ?"
            },
        },
        {
            question: "як ти себе почуваєш",
            answer: {
                answer: "Прекрасно, себе почуваю",
                answer_question: "Чудово. А ти як себе почуваєш ?"
            },
        },
        {
            question: "як часто ти купуєш одяг",
            answer: {
                answer: "Час від часу, змушений це робити",
                answer_question: "Не так часто як хотілось би. А ви ?"
            },
        },
        {
            question: "скільки мов ти знаєш",
            answer: {
                answer: "Три: українську, польську та французьку",
                answer_question: "Я не поліглот, тому бідно розмовляю англійською. А як у вас із мовами ?"
            },
        },
        {
            question: "скільки у тебе було близьких друзів",
            answer: {
                answer: "Двоє: Андрій та Максим, а знайомих із якими підтримую знайомства багато",
                answer_question: "Лише одного друга дитинства. А де ти познайомився із своїм найкращим другом?"
            },
        },
        {
            question: "скільки ти хочеш мати дітей",
            answer: {answer: "Не думав про це ще", answer_question: "Я ще молодий аби про таке думати. А ти ?"},
        },
        {
            question: "скільки пар взуття у тебе",
            answer: {
                answer: "Ніколи не рахував їх, тому не знаю",
                answer_question: "Ніколи не рахував. А навіщо питаєте ?"
            },
        },
        {
            question: "скільки у тебе друзів",
            answer: {answer: "Достатньо", answer_question: "Важко сказати. А у тебе ?"},
        },
        {
            question: "як тебе звати",
            answer: {
                answer: "Мене звати Ігор, я був певен, що ти знаєш це",
                answer_question: "Мене звати Ігор. А тебе як ?"
            },
        },
        {question: "скільки тобі років", answer: {answer: "19", answer_question: "Скоро буде 20. А тобі ?"},},
        {
            question: "як тобі погода",
            answer: {answer: "Обожнюю осінню прохолоду", answer_question: "Прекрасна. А тобі подобається ?"},
        },
        {
            question: "скільки ти важиш",
            answer: {
                answer: "Давно не зважувався, але за карантин набрав трохи",
                answer_question: "Емммм... Не знаю, близько 75, а чому питаєш ?"
            },
        },
    ],
    who: [
        {
            question: "хто твій герой",
            answer: {
                answer: "Бетмен, обожнюю його",
                answer_question: "Немає одного улюбленого, захоплююся всіма. А в тебе ?"
            },
        },
        {
            question: "ким ти хотів бути, коли був маленькими",
            answer: {
                answer: "Це прозвучить смішно, але після перегляду фільма Таксі, то хотів бути таксистом",
                answer_question: "Як і тато - економістом. А ти ?"
            },
        },
        {
            question: "ким хоче стати твоя дитина, коли вона виросте",
            answer: {answer: "Програмістом", answer_question: "У мене немає дітай. А ваша ?"},
        },
        {
            question: "хто твій улюблений автор",
            answer: {answer: "Немає улюбленого, обожнюю всіх", answer_question: "Жюль Верн. А ви ким захоплюєтеся ?"},
        },
        {question: "хто знає тебе краще за всіх", answer: {answer: "Сестра", answer_question: "Сестра. А тебе ?"},},
        {
            question: "хто найрозумніша людина, яку ти знаєш",
            answer: {answer: "Мій дід", answer_question: "Мій дід Віктор. а ти ким захоплюєшся ?"},
        },
        {
            question: "хто був із тобою вчора",
            answer: {answer: "Не пам'ятаю", answer_question: "Важко згадати. А чого питаєш ?"},
        },
        {
            question: "з ким ти був сьогодні",
            answer: {answer: "Не пам'ятаю", answer_question: "Важко згадати. А чого питаєш ?"},
        },
        {
            question: "хтось робив щось хороше для тебе",
            answer: {
                answer: "Так. Таких було багато",
                answer_question: "Так. Таких було багато. А що найнезабутніше тобі робили знайомі?"
            },
        },
    ],
    what: [
        {
            question: "чого ти найбільше боїшся",
            answer: {answer: "А це нехай буде моїм невеличким секретом", answer_question: "Нічого. А ти ?"},
        },
        {
            question: "що б ти хотів змінити в собі якби ти міг",
            answer: {
                answer: "Свою поведінку із страрими знайомими",
                answer_question: "Напевно нічого, не знаю що б змінив би. А ти про це думав ?"
            },
        },
        {question: "що дійсно тебе злить", answer: {answer: "Нічого.", answer_question: "Мої невдачі. А тебе ?"},},
        {
            question: "що мотивує вас ретельно працювати",
            answer: {
                answer: "Перспективи майбутнього",
                answer_question: "Мій крудит за навчання... ахаха, а що стосовно тебе ?"
            },
        },
        {
            question: "що тобі найбільше подобається у твоїй роботі",
            answer: {answer: "Вирішувати невирішуване", answer_question: "Спілкування із людьми. А тобі ?"},
        },
        {
            question: "чим ти найбільше незадоволений у своїй роботі",
            answer: {
                answer: "Дедлайнами та проектами, що надвисли наді мною",
                answer_question: "Насправді всім задоволений. А тебе щось незадовольняє ?"
            },
        },
        {
            question: "чим хочеш займатися далі",
            answer: {
                answer: "Напевно, вдосконаленням того, що знаю",
                answer_question: "Ніколи про це не думав. А ти чим ?"
            },
        },
        {
            question: "що є найбільшим досягненням для твоєї дитини",
            answer: {answer: "У мене немає дітей", answer_question: "У мене немає дітей. А в тебе вже є ?"},
        },
        {
            question: "що змушує тебе сміятися найбільше",
            answer: {answer: "Стендап", answer_question: "Степдап. Ти колись його дивився ?"},
        },
        {
            question: "що ти думаєш думаєте про вибори в америці",
            answer: {
                answer: "Це дуже цікаво, але скажу наступного разу",
                answer_question: "Скажу наступного разу, Тільки не ображайся. Окей?"
            },
        },
        {
            question: "що б ти зробив якби виграли в лотерею",
            answer: {
                answer: "Мандрував би все життя",
                answer_question: "Ахах, як тільки так відразу. а ти вже думав про це ?"
            },
        },
        {
            question: "у що ти грав сьогодні зі своїми друзями",
            answer: {
                answer: "Як із завжди. ми не зраджуємо традиціям",
                answer_question: "Ні,  не встигли. А чому питаєш ?"
            },
        },
        {
            question: "що здивувало тебе сьогодні",
            answer: {answer: "Все як завжди", answer_question: "Нічого невого. а чому цікавишся?"},
        },
        {
            question: "що з тобою трапилося",
            answer: {answer: "Нічого. Все гаразд", answer_question: "Та все добре. А чому запитав це ?"},
        },
        {question: "ну що як ти", answer: {answer: "Все гаразд", answer_question: "Все добре. А ти як ?"},},
        {
            question: "про що ти мрієш",
            answer: {
                answer: "Мрію зараз про подорож",
                answer_question: "Хочеться купити автівку, і поїхати кудись далеко-далеко. А ти ?"
            },
        },
        {
            question: "що ти любиш їсти",
            answer: {answer: "Ахахх...насправді я всеядний", answer_question: "Все що приготують ахах. А ти ?"},
        },
        {
            question: "що ти боїшся",
            answer: {answer: "Як би це банально не прозвучало, але боюся темряви", answer_question: "Нічого. А ти ?"},
        },
    ],
    when: [
        {
            question: "коли ти востаннє працював",
            answer: {
                answer: "не пам'ятаю точно, але це було нещодавно",
                answer_question: "Буквально декілька днів тому. А чому саме це тебе цікавить ?"
            },
        },
        {question: "коли ти відпочивав востаннє", answer: {answer: "Вчора", answer_question: "Позавчора. А ти ?"},},
        {
            question: "коли це сталося ти не пам'ятаєш",
            answer: {answer: "Не дуже цітко пам'ятаю", answer_question: "Забув. А ти не пам'ятаєш?"},
        },


    ],
    where: [
        {
            question: "де ти бачиш себе через п'ять років",
            answer: {answer: "У новій іт-компанії", answer_question: "У новій іт-компанії. А ти ?"},
        },
        {
            question: "де ти бачиш себе через 10 років",
            answer: {answer: "У новій іт-компанії", answer_question: "У новій іт-компанії. А ти ?"},
        },
        {
            question: "де ти відпочивав",
            answer: {answer: "Скрізь де тільки міг", answer_question: "З голови вилетіло. А ти де ?"},
        },
        {question: "куди ти їздив", answer: {answer: "Відпочивати", answer_question: "Відпочивати. А ти ?"},},
        {question: "куди ти літав", answer: {answer: "Відпочивати", answer_question: "Відпочивати. А ти ?"},},
        {
            question: "де ти був вчора",
            answer: {answer: "В Амігосі разом із друзями", answer_question: "В Амігосі. А що таке ?"},
        },
    ],
    which: [
        {
            question: "який твій улюблений сімейний відпочинок",
            answer: {answer: "Коли вся сім'я поруч", answer_question: "Спорт. А твій"},
        },
        {
            question: "яка твоя улюблена книга",
            answer: {answer: "Замок Броуді. Рекомендую", answer_question: "Замок Броуді. Ти читав її ?"},
        },
        {
            question: "на який останній фільм ти ходив",
            answer: {answer: "Шалене весілля", answer_question: "Шалене весілля. А ти ?"},
        },
        {question: "яка твоя улюблена гра", answer: {answer: "Футбол", answer_question: "Волейбол. А твоя?"},},
        {question: "які твої захоплення", answer: {answer: "Малюання", answer_question: "Малювання. а твоє?"},},
        {question: "яка твоя улюблена домашня тварина", answer: {answer: "Пес", answer_question: "Пес. А твоя?"},},
        {
            question: "яку річ ти б ніколи не зробив знову",
            answer: {answer: "Минулих помилок", answer_question: "Минулих помилок. А ти ?"},
        },
        {
            question: "яке твоє улюблене сімейне свято, традиції",
            answer: {answer: "Новий Рік", answer_question: "Новий Рік. А твоє ?"},
        },
        {
            question: "якою була твоя перша робота",
            answer: {
                answer: "Репетитором математики підробляв",
                answer_question: "Репетитором математики підроблявю А ти ким був ?"
            },
        },
        {
            question: "яке заняття робить тебе щасливим",
            answer: {answer: "Спорт мене заряджає", answer_question: "Спорт мене заряджає. А тебе?"},
        },
        {
            question: "яке свято ти любиш найбільше",
            answer: {answer: "Новий Рік", answer_question: "Новий Рікю А ти ?"},
        },
        {
            question: "яке у тебе улюблене заняття",
            answer: {answer: "Однозначно програмування", answer_question: "Немає. А в тебе?"},
        },
        {question: "який ти любиш шоколад", answer: {answer: "Я не люблю його", answer_question: "Всякий. а ти ?"},},
        {question: "в якому місті хотілося б жити", answer: {answer: "У Лондоні", answer_question: "У Лондоні. А ти"},},
        {
            question: "в якій країні хотів би працювати",
            answer: {answer: "В Англії", answer_question: "В Англії. А ти ?"},
        },
        {question: "яка в тебе улюблена гра", answer: {answer: "Футбол", answer_question: "Футбол. А твоя ?"},},
        {
            question: "які книги любиш",
            answer: {answer: "Всі, що потрапляють під руку", answer_question: "Всі, що потрапляють під руку. А ти ?"},
        },
        {
            question: "яка твоя улюблена страва",
            answer: {answer: "Напевно лазанья", answer_question: "Обожнюю голубці. А ти ?"},
        },
        {
            question: "яка твоя улюблена кухня",
            answer: {answer: "Українська, вона дуже смачна і ситна", answer_question: "Напевно грузинська. А твоя ?"},
        },
        {
            question: "який твій улюблений фільм",
            answer: {
                answer: "Как укротить строптивого - да,да я знаю, він старий, але це вічна класика",
                answer_question: "Не знаю, я фільми не дивлюся. А який твій улюблений серіал?"
            },
        },
        {
            question: "який твій улюлений серіал",
            answer: {
                answer: "Грим - топовий американський серіал-фентезі, реально рекомендую",
                answer_question: "Окрам ДРУЗІВ нічого не дивився. А ти можеш щось порадити ?"
            },
        },
        {question: "яке в тебе хоббі", answer: {answer: "", answer_question: ""},},
        {
            question: "яка твоя улюблена гра",
            answer: {answer: "Монополія", answer_question: "Граю лише в настолки, тому Монополія. А твоя?"},
        },
        {
            question: "яка твоя улюблена ігра",
            answer: {
                answer: "WorldOfTanks. Але я в неї вже декілька років не граю",
                answer_question: "Counter-Strike. А ти в що любиш пограти ?"
            },
        },
        {
            question: "яка твоя улюблена пора року",
            answer: {
                answer: "Однозначно осінь - відразу хочеться працювати, а не відпочивати",
                answer_question: "Літо, люблю мандрувати влітку. А ти ?"
            },
        },
        {
            question: "який в тебе зріст",
            answer: {answer: "178 см - мій зріст", answer_question: "Близько 1.8 м. А ти вищій ніж я?"},
        },

    ],
    whom: [
        {
            question: "кого б ти відправв на безлюдний острів",
            answer: {answer: "Своїх ворогів. Ахахха", answer_question: "Ніколи про це не думав. А ти б кого ?"},
        },
        {
            question: "кого ти вчора бачив",
            answer: {
                answer: "Свого давнього знайомого зі школи",
                answer_question: "Свою подругу із курсів. Можливо ти знаєш Марічку ?"
            },
        },
    ],
    why: [
        {
            question: "чому ти вічно все перевіряєш",
            answer: {answer: "Не знаю, не думав проце", answer_question: "Хммм...Навіть не знаю. А як ти думаєш ?"},
        },
        {
            question: "чому так часто пропадаєш",
            answer: {answer: "Ахахахха, ось і пасхалка від ЧБД", answer_question: "Ти знову передивився ЧБД ?"},
        },
        {
            question: "чому тебе вчора не було",
            answer: {
                answer: "Я трохи прихворів просто",
                answer_question: "Я був дуже зайнятим. А що, я пропустив щось важливе ?"
            },
        },
        {
            question: "чому ти це зробив",
            answer: {
                answer: "Мені здалося що я маю це зробити, тому і зробив",
                answer_question: "Мене попросили аби я це зробив. А що ?"
            },
        },
        {
            question: "чому так часто хворієш",
            answer: {
                answer: "А й справі, станнім часом хворію частенько",
                answer_question: "Да зараз всі часто хворіють. Чи ти не згодний ?"
            },
        },
    ],
    or: [
        {question: "чи допоміг ти комусь сьогодні", answer: {answer: "Так", answer_question: "Так. А ти ?"},},
        {question: "чи любиш ти займатися спортом", answer: {answer: "Звичайно", answer_question: "Ні.. А ти?"},},
        {question: "чи був ти на морі", answer: {answer: "Так", answer_question: "Ні. А ти ?"},},
        {question: "чи знаєш ти про  новий айфон", answer: {answer: "Так", answer_question: "Ні. А ти ?"},},
        {question: "чи працюєш ти зараз", answer: {answer: "Так", answer_question: "Зараз ні. А ти ?"},},
        {
            question: "чи бачив ти знаменитостей",
            answer: {answer: "На жаль ні", answer_question: "На жаль так. А ти ?"},
        },
        {question: "чи їздив ти в гімалаї", answer: {answer: "Так таке було", answer_question: "Ні. А ти ?"},},
        {question: "чи часто ти робиш гімнастику", answer: {answer: "Так", answer_question: "Ні. А ти ?"},},
        {
            question: "чи робив ти щось щесь небезпечне",
            answer: {answer: "Ні", answer_question: "Так. Так і ще раз Так. А ти ?"},
        },
        {
            question: "чи є в тебе хоббі",
            answer: {
                answer: "Так, колекціоную тарілочки-міста із різних країн",
                answer_question: "Так, lion dance. А в тебе?"
            },
        },
    ],
    if: [
        {
            question: "якби ти міг жити в будь-якому місці, де б це було",
            answer: {answer: "Лондон. Однозначно Лондон", answer_question: "Київ. Однозначно Київ. А ти ?"},
        },
        {
            question: "якби ти міг вибрати робити що завгодно протягом дня то що б це було",
            answer: {answer: "Дивився би серіали. Ахааххаха", answer_question: "Поїхав би в гори. А ти ?"},
        },
        {
            question: "ти б віддав перевагу: їздити на велосипеді, кататися на коні водити машину",
            answer: {
                answer: "Автівка. Сто відсотків автівка",
                answer_question: "Я би покатався на коні, а ти колись на ньому їздив ?"
            },
        },
        {
            question: "якби ти міг найняти помічника то для чого",
            answer: {answer: "Для таймменеджменту", answer_question: "А він мені не треба. А ти би найняв би ?"},
        },
        {
            question: "якби ти міг повернутися в минуле, в який рік ти б відправився",
            answer: {answer: "2000", answer_question: "2000 купив би біткоїн. А ти в що зробив би ?"},
        },
        {
            question: "як би ваші друзі охарактеризували вас",
            answer: {answer: "Всі по різному", answer_question: "Всі по різному. А тебе ?"},
        },
        {
            question: "якби ти міг повернутися в минуле, щоб змінити одну річ, що б це було",
            answer: {
                answer: "Купив би долар по 8, ахахаха",
                answer_question: "Не думав про таке. А ти б що зробив би ?"
            },
        },
        {
            question: "якби ти був супергероєм, яку силу ти б мав",
            answer: {answer: "Бачити майбутнє", answer_question: "Однозначно літати. А ти б що обрав би?"},
        },
        {
            question: "Якби ти міг поїхати куди завгодно, куди б ти поїхав",
            answer: {answer: "Берлін", answer_question: "З цим карантином нікуди. А ти ?"},
        },
        {
            question: "куди б ти поїхав",
            answer: {answer: "Амстердам", answer_question: "У Харків до друзів. А ти б куди поїхав би?"},
        },
        {
            question: "Якби у тебе було достатньо грошей, щоб не працювати, ти б працював чи ні",
            answer: {answer: "Так. бо без цього було би нудно", answer_question: "Однозначно. А ти ?"},
        },
    ]
}

