let data_common_answers = [
    'Я не дуже тебе розумію',
    'Це складне для мене питання',
    'Важко відповісти тобі',
    'Важко відповісти на це питання',
    'Не  впевнений що зможу відповісти на це питання',
    'Впевнений щ зможу відповісти на це, але наступного разу',
    'Давай наступного разу розкажу',
    'Відповім але не зараз',
    'Вибач але на це я не відповім',
    'Чи ж варто вам задавати такі питання ?!',
    'Прошу не ставити мене в незручне становище!',
    'Боюся, що щира відповідь на це питання зіпсує мою репутацію.',
    'Здогадайтеся самі! ..',
    'Моє збентеження каже, що мені слід промовчати.',
    'Яке тобі до цього справа ?',
    'Я не не думаю про це',
    'Нормально'
]


