module.exports = data_question_words = [
    "як", "скільки",                                //how
    "ким", "хто", "яким", "хтось"                    // who
    , "що", "чим", "чого"                            // what
    , "коли", "котрій"                              // when
    , "де", "куди"                                  // where
    , "яка", "яке", "які", "котрий", "який", "якою"  // which
    , "кого", "кому"                                // whom
    , "чий"                                         // whom
    , "чому"                                        // why
    , "чи"                                          // or
    , "якби", "якщо", "б", "би"                       // if

]
