let data_common_answers = [
    'Я не дуже тебе розумію',
    'це якладне для ене питання',
    'важко відповісти тобі',
    'важко відповісти на це питання',
    'не  впевнений що зможу відповісти на це питання',
    'впевнений щ зможу відповісти на це, але наступного разу',
    'давай наступного разу',
    'відповім але не зараз',
    'вибач але на це я не відповім',
    'чи ж варто вам задавати такі питання ?!',
    'прошу не ставити мене в незручне становище!',
    'Боюся, що щиру відповідь на це питання зіпсує мою репутацію.',
    'Здогадайтеся самі! ..',
    'Моє збентеження каже, що мені слід промовчати.',
    'Яке Вам до цього справа.',
    'Я не допускаю навіть і думки про це.',
    'Мені здається це можливо.'
]


