let data_question_words = [
    "як", "скільки",                                //how
    "ким", "хто", "яким", "хтось"                    // who
    , "що", "чим"                            // what
    , "коли", "котрій"                              // when
    , "де", "куди"                                  // where
    , "яка", "яке", "які", "котрий", "який", "якою", "яку"  // which
    , "кого", "кому", "чий"                          // whom
    , "чому", "чого"                                   // why
    , "чи"                                          // or
    , "якби", "якщо", "б", "би"                       // if
]
